Revit 2017 API
FabricationRodInfo Properties
The FabricationRodInfo type exposes the following members.
Properties
Name | Description
IsAttachedToStructure
 Checks if the hanger is attached to structure.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RodCount
 Gets the number of rods.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace